src/Enums/UserSettingsTypes.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.2">
	<Enum>
		<Properties>
			<Name>UserSettingsTypes</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>PagePrintSetting</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ReportSetting</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Documents/InvoicePayment.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.2">
	<Document>
		<Properties>
			<Name>InvoicePayment</Name>
			<BasedOn>
				<xr:Item>Document.PurchaseInvoice</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.CashFlowData</xr:Item>
				<xr:Item>AccumulationRegister.GeneralJournalAnalyticsDimensions</xr:Item>
				<xr:Item>AccountingRegister.GeneralJournal</xr:Item>
				<xr:Item>AccumulationRegister.BankReconciliation</xr:Item>
				<xr:Item>AccumulationRegister.OrderTransactions</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Company</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Companies</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>RemitTo</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Addresses</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>BankAccount</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.ChartOfAccounts</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>PaymentMethod</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.PaymentMethods</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>PhysicalCheckNum</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>8</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Currency</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Currencies</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>AutoGenerated</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Voided</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Memo</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CashPayment</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>17</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DiscountAmount</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>17</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>UnappliedPayment</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>17</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DocumentTotal</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>17</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DocumentTotalRC</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>17</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>LineItems</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Document</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.GeneralJournalEntry</v8:Type>
								<v8:Type>cfg:DocumentRef.Deposit</v8:Type>
								<v8:Type>cfg:DocumentRef.SalesReturn</v8:Type>
								<v8:Type>cfg:DocumentRef.PurchaseInvoice</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Payment</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>17</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Balance</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>17</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>BalanceFCY</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>17</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Currency</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Currencies</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Check</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Discount</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>17</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Credits</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Document</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.GeneralJournalEntry</v8:Type>
								<v8:Type>cfg:DocumentRef.Check</v8:Type>
								<v8:Type>cfg:DocumentRef.InvoicePayment</v8:Type>
								<v8:Type>cfg:DocumentRef.PurchaseReturn</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Payment</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>17</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/Catalogs/UserSettings.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.2">
	<Catalog>
		<Properties>
			<Name>UserSettings</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ObjectID</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Type</Name>
					<Type>
						<v8:Type>cfg:EnumRef.UserSettingsTypes</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>SettingValue</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>AvailableToAllUsers</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>User</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/CommonForms/PrintFormSettings/Ext/Form/Module.bsl
&AtServer
Procedure OnCreateAtServer(Cancel, StandardProcessing)
	
	//Load paper sizes
	PageSizes = GetCommonTemplate("PageSizes");
	For i = 1 to PageSizes.TableHeight Do 
		PageSizeTitle = StrReplace(TrimAll(PageSizes.Area(i, 1, i, 1).Text), ";", "");
		Items.PageSize.ChoiceList.Add(PageSizeTitle, PageSizeTitle);
	EndDo;
	
	PageSetupStructure 	= new Structure("PageSize, PrintPageOrientation, LeftMargin, RightMargin, TopMargin, BottomMargin, HeaderSize, FooterSize, PrintScale, 
	|FitToPage, PerPage, BlackAndWhite", "Letter", 0, 31.75, 31.75, 25.4, 25.4, 0, 0, 100, True, 1, True); //PageOrientation = Portrait
	
	ObjectTypeID = Parameters.ObjectTypeID;
	PrintPageSetupVS = PrintFormFunctions.GetFromUserSetting(ObjectTypeID);
	
	If PrintPageSetupVS <> Undefined Then
		PPS					= PrintPageSetupVS.Get();
		If TypeOf(PPS) = Type("Structure") Then
			FillPropertyValues(PageSetupStructure, PPS);
		EndIf;
	EndIf;
	
	If ObjectTypeID = "Document.Check (Check)" Or ObjectTypeID = "Document.InvoicePayment (Check)" Then
		PageSetupStructure.LeftMargin = 17 + Constants.CheckHorizontalAdj.Get();
		PageSetupStructure.TopMargin = 15 + Constants.CheckVerticalAdj.Get()
	EndIf;
	
	FillPropertyValues(ThisForm, PageSetupStructure);
	PrintingOption = ?(BlackAndWhite, 1, 0);
	If FitToPage Then
		PrintScaling = 1;
	Else
		PrintScaling = 0;
	EndIf;
	LeftMarginInches	= LeftMargin/25.4;
	RightMarginInches	= RightMargin/25.4;
	TopMarginInches		= TopMargin/25.4;
	BottomMarginInches	= BottomMargin/25.4;
	HeaderSizeInches	= HeaderSize/25.4;
	FooterSizeInches	= FooterSize/25.4;
	
EndProcedure

&AtServer
Procedure SavePageSetupAtServer()
	
	If Not AccessRight("SaveUserData", Metadata) Then
		return;
	EndIf;
	//PageSetupStructure	= new Structure("PrintPageOrientation, LeftMargin, RightMargin, TopMargin, BottomMargin, HeaderSize, FooterSize, PrintScale, 
	//|PerPage, BlackAndWhite");
	PageSetupStructure	= new Structure("PageSize, PrintPageOrientation, LeftMargin, RightMargin, TopMargin, BottomMargin, HeaderSize, FooterSize, PrintScale, 
	|FitToPage, PerPage, BlackAndWhite");
	FillPropertyValues(PageSetupStructure, ThisForm);
	PageSetupStructure.BlackAndWhite = ?(PrintingOption = 1, True, False);
	PageSetupStructure.LeftMargin		= LeftMarginInches*25.4;
	PageSetupStructure.RightMargin		= RightMarginInches*25.4;
	PageSetupStructure.TopMargin		= TopMarginInches*25.4;
	PageSetupStructure.BottomMargin	= BottomMarginInches*25.4;
	PageSetupStructure.HeaderSize		= HeaderSizeInches*25.4;
	PageSetupStructure.FooterSize		= FooterSizeInches*25.4;
	PrintPageSetupVS	= new ValueStorage(PageSetupStructure);
	//If AccessRight("SaveUserData", Metadata) Then
	//	CommonSettingsStorage.Save("PrintFormSettings",, PrintPageSetupVS);
	//EndIf;
	
	BeginTransaction();
	Query = New Query("SELECT
	                  |	UserSettings.Ref
	                  |FROM
	                  |	Catalog.UserSettings AS UserSettings
	                  |WHERE
	                  |	UserSettings.ObjectID = &ObjectID
	                  |	AND UserSettings.Type = VALUE(Enum.UserSettingsTypes.PagePrintSetting)
	                  |	AND UserSettings.AvailableToAllUsers = TRUE");
					  
	Query.SetParameter("ObjectID",ObjectTypeID);
	Result = Query.Execute().Select();
	If Result.Next() Then
		USObj = Result.Ref.GetObject();
	Else	
		USObj = Catalogs.UserSettings.CreateItem();	
	    USObj.ObjectID = ObjectTypeID;
		USObj.AvailableToAllUsers = True;
		USObj.Type = Enums.UserSettingsTypes.PagePrintSetting;
	EndIf; 
	USObj.SettingValue = PrintPageSetupVS;
	USObj.Write();
	
	If ObjectTypeID = "Document.Check (Check)" Or ObjectTypeID = "Document.InvoicePayment (Check)" Then
		Constants.CheckHorizontalAdj.Set(PageSetupStructure.LeftMargin - 17);
		Constants.CheckVerticalAdj.Set(PageSetupStructure.TopMargin - 15);
	EndIf;
	
	CommitTransaction();
	
EndProcedure

&AtClient
Procedure CommandOK(Command)
	
	SavePageSetupAtServer();
	
	Close(DialogReturnCode.OK);
	
EndProcedure

&AtClient
Procedure CommandPrint(Command)
	
	SavePageSetupAtServer();
	
	Close("PrintReport");
	
EndProcedure

&AtClient
Procedure PrintScalingOnChange(Item)
	
	If PrintScaling = 0 Then
		FitToPage = False;
	Else
		FitToPage = True;
	EndIf;
	
EndProcedure
